let a = {
  小区名: '城南小区',
  小区地址: '城南小区',
  物业名称: '城南小区物业',

  联系人电话: '1511111111',
  所属分公司: '公司',
  所属管线所: '城西管线所',

  小区内楼座数量: '3',
  最高楼层: 10,
  小区总服务户数: 100,

  小区二供服务户数: null,
  是否分区: 1,
  分区数量: null,
}
 
let b = Object.keys(y)
// b=['小区名', '小区地址', '物业名称', '联系人电话', '所属分公司', '所属管线所', '小区内楼座数量', '最高楼层', '小区总服务户数', '小区二供服务户数', '是否分区', '分区数量' ]

let m = []
for (let i = 0; i < b.length; ) {
  m.push(b.slice(i, (i += 3)))
}
// [ [] ,[] , []]
console.log(
  m.map(item =>
    item.map(item2 => ({
      title: item2,
      field: item2
    }))
  )
)
 
